Please review and approve this deployment.
**Branch/Commit:** refs/heads/main / 2db6c11100cd3ad6cb450e1adeafe9af8afd4efa
**Workflow run:** https://github.com/JohnMonteir0/LINUXtips-Giropops-Senhas/actions/runs/18194163367

**Plan (last ~500 lines):**
```
module.karpenter.data.aws_region.current: Reading...
data.aws_availability_zones.available: Reading...
module.karpenter_disabled.data.aws_caller_identity.current: Reading...
module.karpenter_disabled.data.aws_partition.current: Reading...
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_partition.current: Reading...
data.aws_caller_identity.current: Reading...
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_caller_identity.current: Reading...
module.eks_bottlerocket.data.aws_partition.current[0]: Reading...
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-074f345b4e04afe86]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.karpenter_disabled.data.aws_partition.current: Read complete after 0s [id=aws]
module.karpenter.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.eks_bottlerocket.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks_bottlerocket.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.karpenter.data.aws_caller_identity.current: Reading...
module.eks_bottlerocket.data.aws_caller_identity.current[0]: Reading...
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Reading...
module.eks_bottlerocket.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.karpenter_disabled.data.aws_region.current: Reading...
module.karpenter_disabled.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.eks_bottlerocket.module.kms.data.aws_caller_identity.current[0]: Reading...
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Read complete after 0s [id=819195744]
module.karpenter.data.aws_partition.current: Reading...
module.karpenter.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_bottlerocket.module.kms.data.aws_partition.current[0]: Reading...
module.eks_bottlerocket.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role.this[0]: Refreshing state... [id=karpenter-node-group-20251002124600615300000004]
module.eks_bottlerocket.aws_iam_role.this[0]: Refreshing state... [id=giropops-cluster-20251002124600615100000002]
module.karpenter_disabled.data.aws_caller_identity.current: Read complete after 0s [id=325204716520]
module.karpenter.aws_iam_role.controller[0]: Refreshing state... [id=KarpenterController-20251002124600613900000001]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_caller_identity.current: Read complete after 0s [id=325204716520]
module.eks_bottlerocket.data.aws_iam_policy_document.custom[0]: Reading...
module.eks_bottlerocket.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117]
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Reading...
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Read complete after 0s [id=2560088296]
module.eks_bottlerocket.aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::325204716520:policy/giropops-cluster-20251002124600615200000003]
data.aws_caller_identity.current: Read complete after 0s [id=325204716520]
module.karpenter.data.aws_caller_identity.current: Read complete after 0s [id=325204716520]
module.eks_bottlerocket.data.aws_caller_identity.current[0]: Read complete after 0s [id=325204716520]
module.eks_bottlerocket.data.aws_iam_session_context.current[0]: Reading...
module.eks_bottlerocket.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=325204716520]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.eks_bottlerocket.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:sts::325204716520:assumed-role/gh-actions-role/gha-tf-plan-18194163367]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_instance_profile.this[0]: Refreshing state... [id=karpenter-node-group-20251002124600980400000005]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=karpenter-node-group-20251002124600615300000004-2025100212460116420000000b]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=karpenter-node-group-20251002124600615300000004-20251002124601111000000009]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=karpenter-node-group-20251002124600615300000004-2025100212460113990000000a]
module.eks_bottlerocket.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=giropops-cluster-20251002124600615100000002-20251002124601061200000006]
module.eks_bottlerocket.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=giropops-cluster-20251002124600615100000002-20251002124601095900000008]
module.eks_bottlerocket.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=giropops-cluster-20251002124600615100000002-20251002124601073800000007]
module.eks_bottlerocket.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks_bottlerocket.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=1363743220]
module.eks_bottlerocket.module.kms.aws_kms_key.this[0]: Refreshing state... [id=7241ca6f-3c80-4e33-98e2-6e1ee4ed7f46]
module.eks_bottlerocket.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/giropops]
module.eks_bottlerocket.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::325204716520:policy/giropops-cluster-ClusterEncryption20251002124630458900000012]
module.eks_bottlerocket.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=giropops-cluster-20251002124600615100000002-20251002124630868100000013]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-06eebd9c7faaf1275]
aws_vpc_ipv4_cidr_block_association.pods: Refreshing state... [id=vpc-cidr-assoc-03760d8109a720239]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0eedf10619aa01efb]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-069ecbada297f5b48]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-06466fad8664a71d7]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-03eb3a0e8a58c74a1]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-058d43cb7c87c4783]
module.vpc.aws_route_table.intra[0]: Refreshing state... [id=rtb-08ab219075a22729c]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-04392c147ac5a980a]
module.eks_bottlerocket.aws_security_group.node[0]: Refreshing state... [id=sg-08e781cb97090edd2]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-03dcee2435bfca1d9]
module.vpc.aws_subnet.intra[0]: Refreshing state... [id=subnet-04666765166b0b8b3]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-075dfe34e97420815]
module.vpc.aws_subnet.intra[1]: Refreshing state... [id=subnet-0cc1a83552fb7358f]
module.vpc.aws_subnet.intra[2]: Refreshing state... [id=subnet-0f243e5203720ac5a]
module.eks_bottlerocket.aws_security_group.cluster[0]: Refreshing state... [id=sg-00f93ae60590299dc]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0fca32a476a76423c]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-066c802bbdf3adf3e]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-014f560507e37c8d9]
aws_subnet.pods["us-east-1a"]: Refreshing state... [id=subnet-01ea8e3fead5aecbc]
aws_subnet.pods["us-east-1b"]: Refreshing state... [id=subnet-04b79e2e2e2110273]
aws_subnet.pods["us-east-1c"]: Refreshing state... [id=subnet-0f59e2799d68f055c]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-04392c147ac5a980a1080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-02036c332a5c686b2]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-053fadfac807d4ffb]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-07fc8140ce674be55]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-01a6d2c048b946096]
module.eks_bottlerocket.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-2262674478]
module.vpc.aws_route_table_association.intra[0]: Refreshing state... [id=rtbassoc-0a01c6c8178ba22ef]
module.vpc.aws_route_table_association.intra[1]: Refreshing state... [id=rtbassoc-03a9814c8786e9ed9]
module.vpc.aws_route_table_association.intra[2]: Refreshing state... [id=rtbassoc-088037459a468fde7]
module.eks_bottlerocket.aws_security_group_rule.node["allow_icmp_from_vpc"]: Refreshing state... [id=sgrule-2806794424]
module.eks_bottlerocket.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-2779916874]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-4063104629]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-996960739]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-4071921322]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-1458255173]
module.eks_bottlerocket.aws_security_group_rule.node["allow_all_from_vpc"]: Refreshing state... [id=sgrule-166241059]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-3594071541]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-162568054]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-3782357588]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-4046077752]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-2245198239]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0331c1d67dec24b95]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0809b4b5eec5b4f45]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-02183b3c116a1c35b]
aws_route_table_association.pods["us-east-1c"]: Refreshing state... [id=rtbassoc-0690a28779dc41289]
aws_route_table_association.pods["us-east-1a"]: Refreshing state... [id=rtbassoc-06266fa03214d60fb]
aws_route_table_association.pods["us-east-1b"]: Refreshing state... [id=rtbassoc-05d0ba3aa43ad693d]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0fba1304d8401081d]
module.eks_bottlerocket.aws_eks_cluster.this[0]: Refreshing state... [id=giropops]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-03dcee2435bfca1d91080289494]
module.eks_bottlerocket.aws_ec2_tag.cluster_primary_security_group["Cluster"]: Refreshing state... [id=sg-08096e130417a07e5,Cluster]
module.eks_bottlerocket.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-08096e130417a07e5,Environment]
module.eks_bottlerocket.aws_ec2_tag.cluster_primary_security_group["GithubRepo"]: Refreshing state... [id=sg-08096e130417a07e5,GithubRepo]
module.eks_bottlerocket.data.tls_certificate.this[0]: Reading...
module.eks_bottlerocket.time_sleep.this[0]: Refreshing state... [id=2025-10-02T12:57:37Z]
module.eks_bottlerocket.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=giropops:arn:aws:iam::325204716520:role/gh-actions-role]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_ssm_parameter.ami[0]: Reading...
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=7367008027624691427]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_eks_access_entry.this[0]: Refreshing state... [id=giropops:arn:aws:iam::325204716520:role/karpenter-node-group-20251002124600615300000004]
module.eks_bottlerocket.data.tls_certificate.this[0]: Read complete after 0s [id=922877a0975ad078a65b8ff11ebc47b8311945c7]
module.eks_bottlerocket.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::325204716520:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/0A8E9613340970E8F6D40EE81FF2F931]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_ssm_parameter.ami[0]: Read complete after 0s [id=/aws/service/bottlerocket/aws-k8s-1.33/x86_64/latest/image_id]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_launch_template.this[0]: Refreshing state... [id=lt-057d597812113dac4]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_autoscaling_group.this[0]: Refreshing state... [id=karpenter-20251002125743257500000022]
module.eks_bottlerocket.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=giropops#arn:aws:iam::325204716520:role/gh-actions-role#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
aws_eks_addon.pod_identity_agent: Refreshing state... [id=giropops:eks-pod-identity-agent]
module.karpenter.aws_cloudwatch_event_rule.this["spot_interrupt"]: Refreshing state... [id=KarpenterSpotInterrupt-20251002125709816000000017]
module.network.data.aws_eks_cluster.this: Reading...
module.network.data.aws_eks_cluster_auth.this: Reading...
module.karpenter.aws_eks_pod_identity_association.karpenter[0]: Refreshing state... [id=a-anyekgqnxk3vpexax]
module.karpenter.aws_iam_role.node[0]: Refreshing state... [id=giropops]
module.karpenter.aws_cloudwatch_event_rule.this["health_event"]: Refreshing state... [id=KarpenterHealthEvent-20251002125709815300000016]
module.network.data.aws_caller_identity.current: Reading...
module.network.data.aws_eks_cluster_auth.this: Read complete after 0s [id=giropops]
module.karpenter.aws_cloudwatch_event_rule.this["instance_rebalance"]: Refreshing state... [id=KarpenterInstanceRebalance-20251002125709806600000014]
module.karpenter.aws_cloudwatch_event_rule.this["instance_state_change"]: Refreshing state... [id=KarpenterInstanceStateChange-20251002125709818100000018]
module.karpenter.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/325204716520/Karpenter-giropops]
module.network.data.aws_caller_identity.current: Read complete after 1s [id=325204716520]
module.aws_auth.kubernetes_config_map.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
data.kubectl_file_documents.karpenter: Reading...
data.kubectl_file_documents.karpenter: Read complete after 0s [id=cca87ae3705f5aa807aa778a8bc242d0a8c8ce897bbcc2ce9070231934b33c1b]
data.kubectl_file_documents.letsencrypt: Reading...
data.kubectl_file_documents.letsencrypt: Read complete after 0s [id=0d35e50690b8b7d4ff7e70e6ee54f4b6ea4d2673b7ecdf32ac7a89e94cb5eb7b]
module.network.data.aws_eks_cluster.this: Read complete after 1s [id=giropops]
module.karpenter.data.aws_iam_policy_document.queue[0]: Reading...
module.karpenter.data.aws_iam_policy_document.queue[0]: Read complete after 0s [id=2002226799]
module.karpenter.aws_sqs_queue_policy.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/325204716520/Karpenter-giropops]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=giropops-2025100212571028400000001c]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKS_CNI_Policy"]: Refreshing state... [id=giropops-2025100212571030850000001d]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=giropops-2025100212571028240000001b]
module.karpenter.data.aws_iam_policy_document.v1[0]: Reading...
module.network.helm_release.cilium: Refreshing state... [id=cilium]
module.karpenter.data.aws_iam_policy_document.v033[0]: Reading...
module.karpenter.data.aws_iam_policy_document.v033[0]: Read complete after 0s [id=125658972]
module.karpenter.aws_iam_role_policy_attachment.node_additional["AmazonSSMManagedInstanceCore"]: Refreshing state... [id=giropops-2025100212571018400000001a]
module.karpenter.data.aws_iam_policy_document.v1[0]: Read complete after 0s [id=3468878596]
module.karpenter.aws_eks_access_entry.node[0]: Refreshing state... [id=giropops:arn:aws:iam::325204716520:role/giropops]
module.karpenter.data.aws_iam_policy_document.controller[0]: Reading...
module.karpenter.data.aws_iam_policy_document.controller[0]: Read complete after 0s [id=125658972]
module.karpenter.aws_iam_policy.controller[0]: Refreshing state... [id=arn:aws:iam::325204716520:policy/KarpenterController-2025100212573535110000001e]
module.karpenter.aws_iam_role_policy_attachment.controller[0]: Refreshing state... [id=KarpenterController-20251002124600613900000001-2025100212573571390000001f]
module.karpenter.aws_cloudwatch_event_target.this["instance_rebalance"]: Refreshing state... [id=KarpenterInstanceRebalance-20251002125709806600000014-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["spot_interrupt"]: Refreshing state... [id=KarpenterSpotInterrupt-20251002125709816000000017-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["health_event"]: Refreshing state... [id=KarpenterHealthEvent-20251002125709815300000016-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["instance_state_change"]: Refreshing state... [id=KarpenterInstanceStateChange-20251002125709818100000018-KarpenterInterruptionQueueTarget]
module.aws_auth.kubernetes_config_map_v1_data.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.network.helm_release.tetragon: Refreshing state... [id=tetragon]
aws_eks_addon.coredns: Refreshing state... [id=giropops:coredns]
module.helm.data.aws_region.current: Reading...
module.helm.data.aws_iam_policy_document.external_dns_policy: Reading...
module.helm.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.helm.helm_release.external_dns: Refreshing state... [id=external-dns]
module.helm.data.aws_caller_identity.current: Reading...
module.helm.data.aws_iam_policy_document.external_dns_policy: Read complete after 0s [id=2902363378]
module.helm.data.aws_iam_policy_document.lb_controller_policy: Reading...
module.helm.data.aws_subnets.public: Reading...
module.helm.helm_release.karpenter: Refreshing state... [id=karpenter]
module.helm.aws_iam_policy.external_dns_policy: Refreshing state... [id=arn:aws:iam::325204716520:policy/eks-external-dns-policy]
module.helm.data.aws_iam_policy_document.lb_controller_policy: Read complete after 0s [id=458242647]
module.helm.aws_iam_policy.load_balancer_controller_policy: Refreshing state... [id=arn:aws:iam::325204716520:policy/eks-load-balancer-controller-policy]
module.helm.data.aws_caller_identity.current: Read complete after 0s [id=325204716520]
module.helm.aws_iam_role.eks_ebs_csi_controller: Refreshing state... [id=ebs-csi-controller-role]
module.helm.aws_iam_role.eks_load_balancer_controller: Refreshing state... [id=eks-load-balancer-controller-role]
module.helm.aws_iam_role.eks_external_dns: Refreshing state... [id=eks-external-dns-role]
module.helm.data.aws_subnets.public: Read complete after 0s [id=us-east-1]
module.helm.aws_iam_role_policy_attachment.attach_load_balancer_policy: Refreshing state... [id=eks-load-balancer-controller-role-20251002130027096200000025]
module.helm.kubernetes_service_account.aws_load_balancer_controller: Refreshing state... [id=kube-system/aws-load-balancer-controller]
module.helm.aws_iam_role_policy_attachment.attach_external_dns_policy: Refreshing state... [id=eks-external-dns-role-20251002130027091400000024]
module.helm.kubernetes_service_account.external_dns: Refreshing state... [id=kube-system/external-dns]
module.helm.helm_release.aws_load_balancer_controller: Refreshing state... [id=aws-load-balancer-controller]
module.helm.aws_iam_role_policy_attachment.attach_ebs_csi_policy: Refreshing state... [id=ebs-csi-controller-role-20251002130027178500000026]
module.helm.kubernetes_service_account.eks_ebs_csi_controller: Refreshing state... [id=kube-system/ebs-csi-controller-sa]
module.helm.helm_release.ingress-nginx: Refreshing state... [id=ingress-nginx]
module.helm.helm_release.cert_manager: Refreshing state... [id=cert-manager]
module.helm.helm_release.kube_prometheus_stack: Refreshing state... [id=kube-prometheus-stack]
module.helm.helm_release.jaeger: Refreshing state... [id=jaeger]
module.helm.helm_release.argocd: Refreshing state... [id=argocd]
module.helm.helm_release.loki: Refreshing state... [id=loki]
module.helm.helm_release.otel_collector: Refreshing state... [id=otel-collector]
module.helm.helm_release.tempo: Refreshing state... [id=tempo]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubectl_manifest.karpenter["/apis/karpenter.k8s.aws/v1/ec2nodeclasses/bottlerocket"] will be created
  + resource "kubectl_manifest" "karpenter" {
      + api_version             = "karpenter.k8s.aws/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "EC2NodeClass"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "bottlerocket"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: karpenter.k8s.aws/v1
            kind: EC2NodeClass
            metadata:
              name: bottlerocket
            spec:
              amiSelectorTerms:
              - alias: bottlerocket@latest
              blockDeviceMappings:
              - deviceName: /dev/xvdb
                ebs:
                  deleteOnTermination: true
                  encrypted: true
                  iops: 3000
                  volumeSize: 20Gi
                  volumeType: gp3
              role: giropops
              securityGroupSelectorTerms:
              - tags:
                  karpenter.sh/discovery: giropops
              subnetSelectorTerms:
              - tags:
                  karpenter.sh/discovery: giropops
              tags:
                karpenter.sh/discovery: giropops
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.karpenter["/apis/karpenter.sh/v1/nodepools/bottlerocket"] will be created
  + resource "kubectl_manifest" "karpenter" {
      + api_version             = "karpenter.sh/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "NodePool"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "bottlerocket"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: karpenter.sh/v1
            kind: NodePool
            metadata:
              name: bottlerocket
            spec:
              disruption:
                consolidateAfter: 30s
                consolidationPolicy: WhenEmpty
              limits:
                cpu: 5000
              template:
                metadata:
                  labels:
                    workload: apps
                spec:
                  nodeClassRef:
                    group: karpenter.k8s.aws
                    kind: EC2NodeClass
                    name: bottlerocket
                  requirements:
                  - key: node.kubernetes.io/instance-type
                    operator: In
                    values:
                    - t3.medium
                  - key: karpenter.sh/capacity-type
                    operator: In
                    values:
                    - on-demand
                  startupTaints:
                  - effect: NoSchedule
                    key: node.giropops.io/agent-not-ready
                    value: "true"
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.letsencrypt["/apis/cert-manager.io/v1/namespaces/cert-manager/clusterissuers/letsencrypt-staging"] will be created
  + resource "kubectl_manifest" "letsencrypt" {
      + api_version             = "cert-manager.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterIssuer"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "letsencrypt-staging"
      + namespace               = "cert-manager"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: cert-manager.io/v1
            kind: ClusterIssuer
            metadata:
              name: letsencrypt-staging
              namespace: cert-manager
            spec:
              acme:
                email: johnmonteiro78@yahoo.com
                privateKeySecretRef:
                  name: letsencrypt-staging
                server: https://acme-staging-v02.api.letsencrypt.org/directory
                solvers:
                - http01:
                    ingress:
                      ingressClassName: nginx
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.helm.helm_release.ebs_csi_driver will be created
  + resource "helm_release" "ebs_csi_driver" {
      + atomic                     = false
      + chart                      = "aws-ebs-csi-driver"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-ebs-csi-driver"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/aws-ebs-csi-driver"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "controller":
                  "serviceAccount":
                    "create": false
                    "name": "ebs-csi-controller-sa"
                "enableVolumeResizing": true
                "enableVolumeScheduling": true
                "enableVolumeSnapshot": true
                "storageClasses":
                - "allowVolumeExpansion": true
                  "annotations":
                    "storageclass.kubernetes.io/is-default-class": "true"
                  "name": "ebs-csi"
                  "parameters":
                    "encrypted": "true"
                    "fsType": "ext4"
                    "type": "gp3"
                  "reclaimPolicy": "Delete"
                  "volumeBindingMode": "WaitForFirstConsumer"
            EOT,
        ]
      + verify                     = false
      + version                    = "2.30.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.helm.helm_release.sonarqube will be created
  + resource "helm_release" "sonarqube" {
      + atomic                     = true
      + chart                      = "sonarqube"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "sonarqube"
      + namespace                  = "sonarqube"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://SonarSource.github.io/helm-chart-sonarqube"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + (sensitive value),
        ]
      + verify                     = false
      + version                    = "2025.5.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```
